rottenpotatoes/app/controllers/movies_controller.rb

  def similar
    @movie = Movie.find params[:id]
    @director_name = @movie.director
    @movies = Movie.where(director: @director_name)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Nam"]]